In [5]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

<font color = "#CC3D3D"><p>
# Topics
* [Reading and Writing Data](#Reading-and-Writing-Data)
* [Creating and Deleting Columns](#Creating-and-Deleting-Columns)
* [Renaming Columns](#Renaming-Columns)
* [Removing Duplicate Rows](#Removing-Duplicate-Rows)
* [Sorting](#Sorting)

## Reading and Writing Data
<br>
<img align="left" src="http://drive.google.com/uc?export=view&id=1PQtlrD6iwmV9kp5uJrcSsLWpkYih9wGI" width=500 height=400>

In [2]:
exam = pd.read_csv('exam.csv')
exam

   ID  Exam1  Exam2  Quiz
0   1    3.3    2.0   3.7
1   2    4.0    4.0   4.0
2   3    2.3    0.0   3.3
3   4    2.2    1.0   3.3
4   5    3.1    1.2   3.9

In [3]:
exam.to_excel('exam.xlsx', index=False)
# 데이터 프레임이 엑셀형식으로 저장.
# index = false 저장할때 인덱스를 제외하고 저장.

In [4]:
%ls #ls로 확인 가능.

AP_0318_01.ipynb
AP_0325_01.ipynb
AP_0401_01.ipynb
AP_0408_01.ipynb
AP_0422_01.ipynb
AP_0422_02.ipynb
AP_0429_01.ipynb
AP_0506_01.ipynb
AP_0513_01.ipynb
AP_0520_01.ipynb
AP_0527_01.ipynb
AP_0527_ex.ipynb
AP_0603_01.ipynb
AP_0610_01.ipynb
AP_0610_02..ipynb
AP_0610_ex.ipynb
Demo.csv
Final_Project/
ISSN_D_tot.csv
L사_거래정보.csv
L사_로그정보.csv
L사_고객정보.csv
L사_상품정보.csv
Obama_words.txt
__pycache__/
assignments/
data_pep.csv
exam.csv
exam.xlsx
examf.csv
features.csv
movie.csv
mymath.py
p01_reading_dirty_data.ipynb
p02_rfm_analysis.ipynb
p02_rfm_analysis_rev(보완).ipynb
p03_market_basket_analysis.ipynb
p03_market_basket_analysis_rev(보완).ipynb
p04_cf_recommender.ipynb
p05_clustering.ipynb
p05_clustering_rev.ipynb
solution/
test/
퀴즈답안지.ipynb
구매내역정보.csv

In [5]:
exam2 = pd.read_excel('exam.xlsx')
exam2

   ID  Exam1  Exam2  Quiz
0   1    3.3    2.0   3.7
1   2    4.0    4.0   4.0
2   3    2.3    0.0   3.3
3   4    2.2    1.0   3.3
4   5    3.1    1.2   3.9

In [ ]:
# 엑셀에서 일부 내용을 복사한 후 클립보드를 이용하여 읽을 수 있다.
# exam3 = pd.read_clipboard()
# exam3

In [7]:
exam2.query('(Exam2 >= 1) & (Quiz < 3.9)')
#&대신 and도 사용가능.

   ID  Exam1  Exam2  Quiz
0   1    3.3    2.0   3.7
3   4    2.2    1.0   3.3

In [8]:
examf = exam.iloc[[4,0],:]
examf

   ID  Exam1  Exam2  Quiz
4   5    3.1    1.2   3.9
0   1    3.3    2.0   3.7

In [7]:
#exam.to_csv('examf.csv', index=False)

In [10]:
%ls examf.csv

examf.csv

In [8]:
# 아래에서 다루는 pandas 기능을 실제 데이터에 적용하기 위해
movie = pd.read_csv('movie.csv')
demo = pd.read_csv('Demo.csv', encoding='cp949')
tran = pd.read_csv('구매내역정보.csv', encoding='cp949', engine='python')

## Creating and Deleting Columns

In [12]:
data = {'state': ['서울', '서울', '서울', '부산', '부산', '부산'],
        'year': [2014, 2016, 2018, 2014, 2016, 2018],
        'pop': [997.5, 984.3, 970.5, 345.2, 344.7, 340.0]}
df = DataFrame(data)
df

  state  year    pop
0    서울  2014  997.5
1    서울  2016  984.3
2    서울  2018  970.5
3    부산  2014  345.2
4    부산  2016  344.7
5    부산  2018  340.0

In [7]:
# south라는 이름의 컬럼을 생성

df['south'] = df.state.isin(['부산', '경남']) #부산이나 경남이 아니라면 false 반환.
df

  state  year    pop  south
0    서울  2014  997.5  False
1    서울  2016  984.3  False
2    서울  2018  970.5  False
3    부산  2014  345.2   True
4    부산  2016  344.7   True
5    부산  2018  340.0   True

In [8]:
# south 컬럼 삭제: 방법1
df.drop('south', axis=1) #axis = 1은 열을 뜻함.
# df = df.drop('south', axis=1)

  state  year    pop
0    서울  2014  997.5
1    서울  2016  984.3
2    서울  2018  970.5
3    부산  2014  345.2
4    부산  2016  344.7
5    부산  2018  340.0

In [9]:
df.drop('south',1)

  state  year    pop
0    서울  2014  997.5
1    서울  2016  984.3
2    서울  2018  970.5
3    부산  2014  345.2
4    부산  2016  344.7
5    부산  2018  340.0

In [10]:
# south 컬럼 삭제: 방법2

df.drop('south', axis=1, inplace=True)
# df2 = df2.drop('south', axis=1)
# del df2['south']
df

  state  year    pop
0    서울  2014  997.5
1    서울  2016  984.3
2    서울  2018  970.5
3    부산  2014  345.2
4    부산  2016  344.7
5    부산  2018  340.0

<font color='blue'>
아래와 같은 조건에 따라 값이 채워지는 새로운 필드 'pop2'를 만들려고 한다. (이 예제는 굉장히 중요한 내용!!!)<br>
if pop > 2 then pop2 = pop + 2, else pop2 = pop + 1.5<br>
--> pop의 값이 2보다 크다면 pop2에는 pop + 2 값을 저장. 그렇지 않다면 pop2에는 pop + 1.5를 저장.

In [18]:
df['pop'] > 500
#조건문만을 실행한다면 boolean값으로 나옴. 이 값에는 true와 false가 섞여 있는데 이 라인이 조건문으로들어간다면
# 프로그램은 해당 값을 True인지 false인지 인식할 수 없음.

0     True
1     True
2     True
3    False
4    False
5    False
Name: pop, dtype: bool

In [17]:
# 아래와 같이 코딩하면 오류가 발생한다!!!

if df['pop'] > 500:
    df['pop2'] = df['pop'] + 2
else:
    df['pop2'] = df['pop'] + 1.5
    
# Series의 값이 참인지 거짓인지 모호하기 때문에 연산할 수 없음.
# 함수로 호출한다는 것은 원소를 하나하나씩 호출하겠다는 의미 즉 파이썬의 문법은 판다스에 모두 적용되지 않음 --> apply 함수를 사용해야함.

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [16]:
df['new'] = df['pop'].apply(lambda x: x+100 if x>500 else x)
df

  state  year    pop     new
0    서울  2014  997.5  1097.5
1    서울  2016  984.3  1084.3
2    서울  2018  970.5  1070.5
3    부산  2014  345.2   345.2
4    부산  2016  344.7   344.7
5    부산  2018  340.0   340.0

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   state   6 non-null      object
 1   year    6 non-null      int64
 2   pop     6 non-null      float64
 3   new     6 non-null      bool
dtypes: bool(1), float64(1), int64(1), object(1)
memory usage: 278.0+ bytes

In [19]:
# 그 이유: Series 타입 변수의 연산은 element-wise이기 때문.

df['pop'] > 2

0    True
1    True
2    True
3    True
4    True
5    True
Name: pop, dtype: bool

In [20]:
# 해결방법: 먼저 아래와 같은 함수를 만든 후,
def f(x) :    
    return x + 2 if x > 2 else x + 1.5

In [21]:
# Series의 apply 메소드를 사용하여 위 함수를 Series의 각 element에 적용한다.
# 얼마 전에 배운 map함수와 유사

df['pop2'] = df['pop'].apply(f) #pop 칼럼의 모든 값이 f라는 함수를 적용하여 pop2에 저장.
df

  state  year    pop  south   pop2
0    서울  2014  997.5  False  999.5
1    서울  2016  984.3  False  986.3
2    서울  2018  970.5  False  972.5
3    부산  2014  345.2   True  347.2
4    부산  2016  344.7   True  346.7
5    부산  2018  340.0   True  342.0

In [22]:
x = [1,2,3,4,5]
Series(x).apply(lambda x: np.sqrt(x))

0    1.000000
1    1.414214
2    1.732051
3    2.000000
4    2.236068
dtype: float64

In [23]:
# 위 해결방법이 이해가 되지 않으면, np.where()라는 numpy에서 제공하는 함수를 쓰면된다.
# 이 함수는 excel의 IF()함수와 사용법이 같다.
df['pop2'] = np.where(df['pop'] > 2, df['pop'] + 2, df['pop'] + 1.5)
df

  state  year    pop  south   pop2
0    서울  2014  997.5  False  999.5
1    서울  2016  984.3  False  986.3
2    서울  2018  970.5  False  972.5
3    부산  2014  345.2   True  347.2
4    부산  2016  344.7   True  346.7
5    부산  2018  340.0   True  342.0

In [23]:
# lambda 함수를 사용할 줄 아는 사람은 아래와 같이 깔끔하게 코딩토록 하자.
# 이해가 되지 않으면 지금은 그냥 무시해도 된다.

df['pop2'] = df['pop'].apply(lambda x: x + 2 if x > 2 else x + 1.5)
df

  state  year    pop   pop2
0    서울  2014  997.5  999.5
1    서울  2016  984.3  986.3
2    서울  2018  970.5  972.5
3    부산  2014  345.2  347.2
4    부산  2016  344.7  346.7
5    부산  2018  340.0  342.0

## Renaming Columns

In [24]:
data = {'state': ['서울', '서울', '서울', '부산', '부산', '부산'],
        'year': [2014, 2016, 2018, 2014, 2016, 2018],
        'pop': [997.5, 984.3, 970.5, 345.2, 344.7, 340.0]}
df = DataFrame(data)
df

  state  year    pop
0    서울  2014  997.5
1    서울  2016  984.3
2    서울  2018  970.5
3    부산  2014  345.2
4    부산  2016  344.7
5    부산  2018  340.0

In [26]:
# rename을 column 뿐만아니라 index에도 적용할 수 있기 때문에 columns 파라미터가 필요하다는 걸 명심하자.

df.rename(columns = {'pop': '인구'})

  state  year     인구
0    서울  2014  997.5
1    서울  2016  984.3
2    서울  2018  970.5
3    부산  2014  345.2
4    부산  2016  344.7
5    부산  2018  340.0

In [29]:
df = df.rename(columns = {'pop': '인구', 'state': '광역시', 'year':'연도' })
df

  광역시    연도     인구
0  서울  2014  997.5
1  서울  2016  984.3
2  서울  2018  970.5
3  부산  2014  345.2
4  부산  2016  344.7
5  부산  2018  340.0

## Removing Duplicate Rows

In [30]:
df = DataFrame({'k1': ['one'] * 3 + ['two'] * 4,
                  'k2': [1, 1, 2, 3, 3, 4, 4]})
df

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

In [33]:
a = df.drop_duplicates() #곂치는 값들 제거 index도 함께 제거됨
a

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

In [34]:
df['v1'] = range(7) # v1 칼럼을 생성하여 0~6 까지의 값을 입력.
df

    k1  k2  v1
0  one   1   0
1  one   1   1
2  one   2   2
3  two   3   3
4  two   3   4
5  two   4   5
6  two   4   6

In [30]:
df.drop_duplicates(['k1']) #k1 칼럼에 대해서 중복되는 것들 삭제 이때 반환하는 것은 가장 조건에 가장 첫번째 값.

    k1  k2  v1
0  one   1   0
3  two   3   3

<font color = 'blue'>Duplicated and drop_duplicates by default keep the first observed value combination. Passing *keep='last'* will return the last one: <br>
Duplicated and drop_duplicates의 keep 매개변수의 기본값은 first이다.

In [31]:
df.drop_duplicates(['k1', 'k2'], keep='last') #중복되는 값중에 가장 마지막 값을 반환. / 기본값은 first 임.

    k1  k2  v1
1  one   1   1
2  one   2   2
4  two   3   4
6  two   4   6

## Sorting

In [35]:
df = DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
df

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [37]:
df.sort_values(by='b') # 칼럼 b에 대해서 오름차순으로 정렬.

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

<font color = 'blue'>The data is sorted in ascending order by default, but can be sorted in descending order,too:

In [39]:
df.sort_values(by='b', ascending=False) # ascending = false하여 내림차순으로 정렬함.

   b  a
1  7  1
0  4  0
3  2  1
2 -3  0

<font color = 'blue'>To sort by multiple columns, pass a list of names:

In [40]:
df.sort_values(by=['a', 'b']) # a순으로 sorting한후 b에 대해서 sorting함.

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [42]:
df

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

<font color = 'blue'>Ranking is closely related to sorting, assigning ranks from one through the number of valid data points in an array.

In [41]:
df.rank()
#각 칼럼에 대해서 순위를 매겨줌 값이 같다면 평균값을 반환.

     b    a
0  3.0  1.5
1  4.0  3.5
2  1.0  1.5
3  2.0  3.5

In [43]:
df.rank(method = 'average')
# rank 함수의 method paramete의 기본값은 average(평균값)
#

     b    a
0  3.0  1.5
1  4.0  3.5
2  1.0  1.5
3  2.0  3.5

In [37]:
df.rank(method = 'min') #최소값을 기준으로 반환.

     b    a
0  3.0  1.0
1  4.0  3.0
2  1.0  1.0
3  2.0  3.0

<font color = "#CC3D3D"><p>
# End